import pandas as pd
import pytest


@pytest.fixture
def excel_list_dict():
    return [
        {'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
         'Сумма операции': -160.89, 'Валюта операции': 'RUB', 'Сумма платежа': -160.89, 'Валюта платежа': 'RUB',
         'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 3,
         'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 160.89},
        {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
         'Сумма операции': -64.0, 'Валюта операции': 'RUB', 'Сумма платежа': -64.0, 'Валюта платежа': 'RUB',
         'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 1,
         'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 64.0},
        {'Дата операции': '31.12.2021 16:39:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
         'Сумма операции': -118.12, 'Валюта операции': 'RUB', 'Сумма платежа': -118.12, 'Валюта платежа': 'RUB',
         'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Магнит', 'Бонусы (включая кэшбэк)': 2,
         'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 118.12},
        {'Дата операции': '31.12.2021 15:44:39', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK',
         'Сумма операции': -78.05, 'Валюта операции': 'RUB', 'Сумма платежа': -78.05, 'Валюта платежа': 'RUB',
         'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 1,
         'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 78.05},
        {'Дата операции': '31.12.2021 01:23:42', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK',
         'Сумма операции': -564.0, 'Валюта операции': 'RUB', 'Сумма платежа': -564.0, 'Валюта платежа': 'RUB',
         'Кэшбэк': '', 'Категория': 'Различные товары', 'MCC': 5399.0, 'Описание': 'Ozon.ru',
         'Бонусы (включая кэшбэк)': 5, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 564.0}]


@pytest.fixture
def file_name():
    return "file"


@pytest.fixture
def data_frame():
    return pd.DataFrame({"Yes": [50, 21], "No": [131, 2]})

@pytest.fixture
def list_search():
    return [{
        "Дата операции": "05.11.2020 19:19:14",
        "Дата платежа": "05.11.2020",
        "Номер карты": "",
        "Статус": "OK",
        "Сумма операции": -10.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -10.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "",
        "Категория": "Мобильная связь",
        "MCC": "",
        "Описание": "МТС +7 981 976-14-20",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 10.0
    },{
        "Дата операции": "05.11.2020 19:19:14",
        "Дата платежа": "05.11.2020",
        "Номер карты": "",
        "Статус": "OK",
        "Сумма операции": -10.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -10.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "",
        "Категория": "Мобильная связь",
        "MCC": "",
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 10.0
    }]